# 2 ТИП ЗАДАЧ


## № 15618
Логическая функция F задаётся выражением (x ∧ ¬y) ∨ (y ≡ z) ∨ ¬w. На рисунке приведён фрагмент таблицы истинности функции F, содержащий все наборы аргументов, при которых функция F ложна. 
Определите, какому столбцу таблицы истинности функции F соответствует каждая из переменных w, x, y, z. Все строки в представленном фрагменте разные.

```
print("x y z w")
for i in range(16):
    x, y, z, w = i >> 3 & 1, i >> 2 & 1, i >> 1 & 1, i & 1
    if not ((x and not y) or (y == z) or not w):
        print(x, y, z, w)
```
ответ:
```
w	z	y	x
1	0	1	1
1	0	1	0
1	1	0	0
```
## № 26974
Логическая функция F задаётся выражением (x ∨ y) ∧ ¬(y ≡ z) ∧ ¬w. На рисунке приведён частично заполненный фрагмент таблицы истинности функции F, содержащий неповторяющиеся строки. 
Определите, какому столбцу таблицы истинности функции F соответствует каждая из переменных x, y, z, w.

```
from itertools import product
print("x y z w")
for x, y, z, w in product([0, 1], repeat=4):
    if (x or y) and (y != z) and not w:
        print(x, y, z, w)
```
ответ:
```
x	z	y	w	Функция
1		 		1
0	0	1	0	1
1	0	0	1
```
## № 28677
Логическая функция F задаётся выражением ((x → y) ∨ (y ≡ w)) ∧ ((x ∨ z) ≡ w). На рисунке приведён частично заполненный фрагмент таблицы истинности функции F, содержащий неповторяющиеся строки. 
Определите, какому столбцу таблицы истинности функции F соответствует каждая из переменных x, y, z, w.
```
print("x y z w")
for i in range(16):
    x = (i >> 3) & 1
    y = (i >> 2) & 1
    z = (i >> 1) & 1
    w = i & 1
    if ((x <= y) or (y == w)) and ((x or z) == w):
        print(x, y, z, w)
```
ответ:
```
z	y	x	w	F
1	0	0	1	1
0	-	-	1	1
-   1	0	-	1
```
## № 15124
Логическая функция F задаётся выражением (x ≡ y ) ∨ ((y ∨ z) → x).
Дан частично заполненный фрагмент, содержащий неповторяющиеся строки таблицы истинности функции F.
Определите, какому столбцу таблицы истинности соответствует каждая из переменных x, y, z.
```
print("x y z")
[print(x, y, z) for x in range(2) for y in range(2) for z in range(2) if not((x == y) or ((y or z) <= x))]
```
ответ:
```
x	z	y	F
-   1	1	0
-   -   1	0
```
## № 15970
Логическая функция F задаётся выражением (x ∧ ¬y) ∨ (y ≡ z ) ∨ w.
Дан частично заполненный фрагмент, содержащий неповторяющиеся строки таблицы истинности функции F.
Определите, какому столбцу таблицы истинности соответствует каждая из переменных x, y, z, w.
 
```
print("x y z w")
for x in range(0, 2):
    for y in range(0, 2):
        for z in range(0, 2):
            for w in range(0, 2):
                if not((x and not(y)) or (y == z) or w):
                    print(x, y, z, w)
```
ответ:
```
y	x	w	z	F
-   -   -   1	0
1	0	0	0	0
1	1	0	-   0
```
## № 18614
Логическая функция F задаётся выражением ((w → ¬x) ≡ (z → y)) ∧ (y ∨ w).
Дан частично заполненный фрагмент, содержащий неповторяющиеся строки таблицы истинности функции F.
Определите, какому столбцу таблицы истинности соответствует каждая из переменных x, y, z, w.
```
print("x y z w")
for x in range(0, 2):
    for y in range(0, 2):
        for z in range(0, 2):
            for w in range(0, 2):
                if ((w <= (not x)) == (z <= y)) and (y or w):
                    print(x, y, z, w)
```
ответ:
```
x	w	y	z	F
1	1	1	0	0
0	0	1	1	1
0	-	0	-	1
```
## № 55589
Две логические функции заданы выражениями:
F1  =  (x → y)≡(w ∨ ¬ z),
F2  =  (x → y)∧(¬w≡z).
Дан частично заполненный фрагмент, содержащий неповторяющиеся строки таблицы истинности обеих функций.
Определите, какому столбцу таблицы истинности соответствует каждая из переменных w, x, y, z.
```
def f_1(x, y, z, w):
    if ((x <= y) == (w or not(z))) == 1:
        return 1
    else:
        return 0
def f_2(x, y, z, w):
    if ((x <= y) and (not(w) == z)) == 1:
        return 1
    else:
        return 0
print('x y z w  f1 f2')
for x in range(2):
    for y in range(2):
        for z in range(2):
            for w in range(2):
                print(x, y, z, w, ' ', f_1(x, y, z, w), ' ',f_2(x, y, z, w))
```
ответ:
```
x	z	y	w  F1 F2
-   1	0	1	-  0
-   0	0	0	0  -
0   -   0	0	0  1
```
## № 48423
Логическая функция F задаётся выражением:

(x → (y ≡ w)) ∧ (y ≡ (w → z)).

Дан частично заполненный фрагмент, содержащий неповторяющиеся строки таблицы истинности функции F.

Определите, какому столбцу таблицы истинности соответствует каждая из переменных x, y, z, w.
```
print("x y z w")
for x in range(0, 2):
    for y in range(0, 2):
        for z in range(0, 2):
            for w in range(0, 2):
                if not((x <= (y == w)) and (y == (w <= z))):
                    print(x, y, z, w)
```
ответ:
```
y	x	w	z	F
1	-	0	1	1
0	0	-	0	1
0	0	0	1	0
```
## № 15787
 Логическая функция F задаётся выражением ((x → y ) ∧ (y → w)) ∨ (z ≡ ( x ∨ y)).
Дан частично заполненный фрагмент, содержащий неповторяющиеся строки таблицы истинности функции F.
Определите, какому столбцу таблицы истинности соответствует каждая из переменных x, y, z, w.
```
print("x y z w")
for x in range(0, 2):
    for y in range(0, 2):
        for z in range(0, 2):
            for w in range(0, 2):
                if not(((x <= y) and (y <= w)) or (z == (x or y))):
                    print(x, y, z, w)
```
ответ:
```
y	w	z	x	F
1	-	-	1	0
1	-	-	-	0
1	-	1	0   -
```
## № 85678
Миша заполнял таблицу истинности логической функции F
¬w ∨ ((z → x) → y)
но успел заполнить лишь фрагмент из трёх различных её строк, даже не указав, какому столбцу таблицы соответствует каждая из переменных w, x, y, z.
```
print("x y z w")
for x in range(0, 2):
    for y in range(0, 2):
        for z in range(0, 2):
            for w in range(0, 2):
                if not(not(w) or ((z <= x) <= y)):
                    print(x, y, z, w)
```
ответ:
```
y	x	w	z	F
0	-	-	0   -
0	1	-	0	0
1	0   -   -   -
```
## № 18578
Логическая функция F задаётся выражением ((x ∧ ¬y) ∨ (w → z)) ≡ (z ≡ x).
Дан частично заполненный фрагмент, содержащий неповторяющиеся строки таблицы истинности функции F.
Определите, какому столбцу таблицы истинности соответствует каждая из переменных x, y, z, w.
```
print("x y z w")
for x in range(0, 2):
    for y in range(0, 2):
        for z in range(0, 2):
            for w in range(0, 2):
                if ((x and not y) or (w <= z)) == (z == x):
                    print(x, y, z, w)
```
ответ:
```
z	y	w	x	F
0	0	1	1   -
0	1	0	0	1
0	-	-	1	1
```
## № 81786
Миша заполнял таблицу истинности логической функции F:
(x∨y)∧¬(y≡z)∧¬w,
но успел заполнить лишь фрагмент из трёх различных её строк, даже не указав, какому столбцу таблицы соответствует каждая из переменных w, x, y, z.
```
print("x y z w")
for x in range(0, 2):
    for y in range(0, 2):
        for z in range(0, 2):
            for w in range(0, 2):
                if (x or y) and (not(y == z)) and (not (w)):
                    print(x, y, z, w)
```
ответ:
```
z  	y   x	w  	F 
1	-	1	-	1
0	1	-	0	1
1	1	0	1   -
```
## № 17320

```

```
```
???|???|???|???
   |   |   |   
   |   |   |   
   |   |   |   
```
## № 48450

```

```
```
???|???|???|???
   |   |   |   
   |   |   |   
   |   |   |   
```
## № 40718

```

```
```
???|???|???|???
   |   |   |   
   |   |   |   
   |   |   |   
```
## № 73828

```

```
```
???|???|???|???
   |   |   |   
   |   |   |   
   |   |   |   
```
## № 45236

```

```
```
???|???|???|???
   |   |   |   
   |   |   |   
   |   |   |   
```
## № 33504

```

```
```
???|???|???|???
   |   |   |   
   |   |   |   
   |   |   |   
```
## № 64932

```

```
```
???|???|???|???
   |   |   |   
   |   |   |   
   |   |   |   
```
## № 64887

```

```
```
???|???|???|???
   |   |   |   
   |   |   |   
   |   |   |   
```
## № 72587

```

```
```
???|???|???|???
   |   |   |   
   |   |   |   
   |   |   |   
```
