# 2 ТИП ЗАДАЧ
## № 15618
Логическая функция F задаётся выражением (x ∧ ¬y) ∨ (y ≡ z) ∨ ¬w. На рисунке приведён фрагмент таблицы истинности функции F, содержащий все наборы аргументов, при которых функция F ложна. 
Определите, какому столбцу таблицы истинности функции F соответствует каждая из переменных w, x, y, z. Все строки в представленном фрагменте разные.

```
print("x y z w")
for i in range(16):
    x, y, z, w = i >> 3 & 1, i >> 2 & 1, i >> 1 & 1, i & 1
    if not ((x and not y) or (y == z) or not w):
        print(x, y, z, w)
```
## № 26974
Логическая функция F задаётся выражением (x ∨ y) ∧ ¬(y ≡ z) ∧ ¬w. На рисунке приведён частично заполненный фрагмент таблицы истинности функции F, содержащий неповторяющиеся строки. 
Определите, какому столбцу таблицы истинности функции F соответствует каждая из переменных x, y, z, w.

```
from itertools import product
print("x y z w")
for x, y, z, w in product([0, 1], repeat=4):
    if (x or y) and (y != z) and not w:
        print(x, y, z, w)
```
## № 28677
Логическая функция F задаётся выражением ((x → y) ∨ (y ≡ w)) ∧ ((x ∨ z) ≡ w). На рисунке приведён частично заполненный фрагмент таблицы истинности функции F, содержащий неповторяющиеся строки. 
Определите, какому столбцу таблицы истинности функции F соответствует каждая из переменных x, y, z, w.
```
print("x y z w")
for i in range(16):
    x = (i >> 3) & 1
    y = (i >> 2) & 1
    z = (i >> 1) & 1
    w = i & 1
    if ((x <= y) or (y == w)) and ((x or z) == w):
        print(x, y, z, w)
```
## № 15124
Логическая функция F задаётся выражением (x ≡ y ) ∨ ((y ∨ z) → x).
Дан частично заполненный фрагмент, содержащий неповторяющиеся строки таблицы истинности функции F.
Определите, какому столбцу таблицы истинности соответствует каждая из переменных x, y, z.
```
print("x y z")
[print(x, y, z) for x in range(2) for y in range(2) for z in range(2) if not((x == y) or ((y or z) <= x))]
```
## № 15970
Логическая функция F задаётся выражением (x ∧ ¬y) ∨ (y ≡ z ) ∨ w.
Дан частично заполненный фрагмент, содержащий неповторяющиеся строки таблицы истинности функции F.
Определите, какому столбцу таблицы истинности соответствует каждая из переменных x, y, z, w.
 
```
print("x y z w")
for x in range(0, 2):
    for y in range(0, 2):
        for z in range(0, 2):
            for w in range(0, 2):
                if not((x and not(y)) or (y == z) or w):
                    print(x, y, z, w)
```
## № 18614
Логическая функция F задаётся выражением ((w → ¬x) ≡ (z → y)) ∧ (y ∨ w).
Дан частично заполненный фрагмент, содержащий неповторяющиеся строки таблицы истинности функции F.
Определите, какому столбцу таблицы истинности соответствует каждая из переменных x, y, z, w.
```
print("x y z w")
for x in range(0, 2):
    for y in range(0, 2):
        for z in range(0, 2):
            for w in range(0, 2):
                if ((w <= (not x)) == (z <= y)) and (y or w):
                    print(x, y, z, w)
```
## № 55589

```

```
## № 48423

```

```
## № 15787
 
```

```
## № 85678

```

```
## № 18578

```

```
## № 81786

```

```
## № 17320

```

```
## № 48450

```

```
## № 40718

```

```
## № 73828

```

```
## № 45236

```

```
## № 33504

```

```
## № 64932

```

```
## № 64887

```

```
## № 72587

```

```
