РЕШЕНИЕ 6 ЗАДАЧ ЕГЭ ПО ИНФОРМАТИКЕ


# ЗАДАЧА 1:
Напишите программу, которая ищет среди целых чисел, принадлежащих числовому отрезку [10000;
20001], числа, имеющие ровно 5 различных делителей. Выведите эти делители для каждого найденного
числа в порядке возрастания.

```
for число in range(10000, 20002):
    делители = []
    for д in range(1, число + 1):
        if число % д == 0:
            делители.append(д)
    if len(делители) == 5:
        print(f"Число {число}: {делители}")

print("\n" + "=" * 60 + "\n")
```

# ЗАДАЧА 2:
Напишите программу, которая ищет среди целых чисел, принадлежащих числовому отрезку [10000;
12345], простые числа. Выведите сумму этих чисел.

```
    if число < 2:
        return False
    for д in range(2, число):
        if число % д == 0:
            return False
    return True

сумма = 0
for число in range(10000, 12346):
    if простое(число):
        сумма += число

print(f"Сумма простых чисел = {сумма}")

print("\n" + "=" * 60 + "\n")
```

# ЗАДАЧА 3:
Обозначим через ДЕЛ(n, m) утверждение «натуральное число n делится без остатка на натуральное число
m». Для какого наибольшего натурального числа А формула
(¬ДЕЛ(x, A) ∧ ДЕЛ(x, 4)) → ¬ДЕЛ(x, 9)
тождественно истинна (т.е. принимает значение 1 при любом натуральном значении переменной x)?
Напишите программу для решения данной задачи.

```
    return x % a == 0

наибольшее_А = 0
for А in range(1, 1000):
    подходит = True
    for х in range(1, 500):
        левая = (not делится(х, А)) and делится(х, 4)
        правая = not делится(х, 9)
        if левая and not правая:
            подходит = False
            break
    if подходит:
        наибольшее_А = А

print(f"Наибольшее А = {наибольшее_А}")

print("\n" + "=" * 60 + "\n")
```

# ЗАДАЧА 4: Логическое уравнение с неравенствами
Для какого наименьшего числа А формула
(x > 15) ∨ (x < 2y) ∨ (A > x+y)
тождественно истинна для любых целых положительных значений x и y. Напишите программу для
решения данной задачи.

```
for А in range(1, 100):
    подходит = True
    for х in range(1, 50):
        for у in range(1, 50):
            if not (х > 15) and not (х < 2 * у) and not (А > х + у):
                подходит = False
                break
        if not подходит:
            break
    if подходит:
        print(f"Наименьшее А = {А}")
        break

print("\n" + "=" * 60 + "\n")
```

# ЗАДАЧА 5: Автомат (наибольшее число < 100)
Автомат обрабатывает натуральное число N по следующему алгоритму:
1. Строится двоичная запись числа N.
2. Складываются все цифры полученной двоичной записи. В конец записи (справа) дописывается
остаток от деления полученной суммы на 2
3. Предыдущий пункт повторяется для записи с добавленной цифрой.
4. Результат переводится в десятичную систему и выводится на экран.
Пример. Дано число N = 35 Алгоритм работает следующим образом:
1. Двоичная запись числа N: 100011
2. Сумма цифр двоичной записи 3, остаток от деления на 2 равен 1, новая запись 1000111
3. Сумма цифр полученной записи 4, остаток от деления на 2 равен 0, новая запись 10001110
4. На экран выводится число 142
Какое наибольшее число, меньшее 100, может появиться на экране в результате работы автомата?

```
    двоичная = bin(N)[2:]
    
    сумма1 = двоичная.count('1')
    двоичная += str(сумма1 % 2)
    
    сумма2 = двоичная.count('1')
    двоичная += str(сумма2 % 2)
    
    return int(двоичная, 2)

наибольший = 0
for N in range(1, 200):
    R = автомат(N)
    if R < 100 and R > наибольший:
        наибольший = R

print(f"Наибольшее число < 100 = {наибольший}")

print("\n" + "=" * 60 + "\n")
```

# ЗАДАЧА 6:
Автомат обрабатывает натуральное число N по следующему алгоритму:
1. Строится двоичная запись числа N.
2. Складываются все цифры полученной двоичной записи. В конец записи (справа) дописывается
остаток от деления полученной суммы на 2
3. Предыдущий пункт повторяется для записи с добавленной цифрой.
4. Результат переводится в десятичную систему и выводится на экран.
Пример. Дано число N = 35 Алгоритм работает следующим образом:
1. Двоичная запись числа N: 1101
2. Сумма цифр двоичной записи 3, остаток от деления на 2 равен 1, новая запись 1000111
3. Сумма цифр полученной записи 4, остаток от деления на 2 равен 0, новая запись 10001110
4. На экран выводится число 142
При каком наибольшем числе N алгоритм выведет число, меньшее 150?

```
for N in range(1, 200):
    R = автомат(N)
    if R < 150 and N > наибольшее_N:
        наибольшее_N = N

print(f"Наибольшее N = {наибольшее_N}")

print("\n" + "=" * 60)
```

